AAlben/STC89_with_GSM_communication/C51_code/with_gsm_module_communication_Nb.c
#include <reg52.h>
# define uchar unsigned char
# define uint unsigned int
unsigned char flag, a, i;
uchar code table[] = "Hello";
uchar sms_text[] = "123";
sbit led1=P0^1;

void Uart1Sends(uchar *str);
void Uart1Send(uchar c);
void DelaySec(uint sec);

void init()
{
    SCON=0X50;          //???????1
    TMOD=0X20;          //?????????2
    PCON=0X80;          //?????
    TH1=0XF3;               //????????,??????4800?
    TL1=0XF3;
    TR1=1;                  //?????  
    
    SM0=0;//??????????,(10?????,?????,????1??????)
    SM1=1;//(??)?????,????????????????
    REN=1;//???????(????sm0sm1??????)
    
    ES=1;                       //??????
    EA=1;                       //?????
    
}

void main()
{
    init();

    while(1)
    {
        DelaySec(5);//??3?
        led1 = 0;
        Uart1Sends("AT+CMGF=1\r");
        Uart1Send(0x0a);
        DelaySec(10);//??3?
        led1 = 1;
        Uart1Sends("AT+CSCS=\"GSM\"\r");
        Uart1Send(0x0a);
        DelaySec(3);//??3?
        led1 = 0;
        Uart1Sends("AT+CSMP=17,167,0,250\r");//??????(????????)
        Uart1Send(0x0a);
        //        Uart1Sends("AT+CSMP=17,167,0,240\r");//??????(?????????)
        DelaySec(3);//??3?
        led1 = 1;
        Uart1Sends("AT+CMGS=\"+8618624030589\"\r");
        Uart1Send(0x0a);
        DelaySec(5);//??3?              
        led1 = 0;
        Uart1Sends(sms_text);
        Uart1Send(0x0d);
        Uart1Send(0x0a);
        led1 = 1;
        DelaySec(15);//??20?
        led1 = 0;
    }
}

void Usart() interrupt 4
{
    char receiveData;

    receiveData=SBUF;//????????
    RI = 0;//????????? 
}

void Uart1Send(uchar c)
{
    SBUF=c;
    while(!TI);//????????(TI=1)??
    TI=0;        
}

void Uart1Sends(uchar *str)
{
    while(*str!='\0')
    {
        SBUF=*str;
        while(!TI);//????????(TI=1)??
        TI=0;
        str++;
    }
}

void DelaySec(uint sec)
{
    uint i , j= 0;

    for(i=0; i<sec; i++)
    {
        for(j=0; j<65535; j++);
    }        
}